## [ 접근자 Accessor ]
- Series/DataFrame의 데이터가 날짜시간(datetime), 문자열(object), 범주형(Category)등의 경우 데이터타입과 관련된 전용의 함수들을 사용할 수 있도록 해주는 속성
- Series.str.문자열처리관련함수명()
- Series.dt.날짜시간처리관련속성명

(1) 모듈로딩

In [41]:
import pandas as pd

(2) 데이터 준비

In [42]:
datas = {'name':[" 홍 길동", "이 나영", "마 징가", "베 토벤"], 
         "age":[10, 21, 73, 89],
         "reg_date":['2000/01/23', '2020/11/8', '1999/5/4', '1987/12/23']}

datas2 = [[" 홍 길동", "이 나영", "마 징가", "베 토벤"], 
         [10, 21, 73, 89],
         ['2000/01/23', '2020/11/8', '1999/5/4', '1987/12/23']]

(3) 데이터 저장

In [43]:
# Dict ==> DataFrame
df1 = pd.DataFrame(datas)
df1

    name  age    reg_date
0   홍 길동   10  2000/01/23
1   이 나영   21   2020/11/8
2   마 징가   73    1999/5/4
3   베 토벤   89  1987/12/23

In [44]:
# List ==> DataFrame
df2 = pd.DataFrame(datas2)
df2

            0          1         2           3
0        홍 길동       이 나영      마 징가        베 토벤
1          10         21        73          89
2  2000/01/23  2020/11/8  1999/5/4  1987/12/23

(4) 데이터 정보 확인

In [45]:
# 데이터의 전체 기본 정보 => info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      object
 2   2       3 non-null      object
 3   3       3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

(5) 데이터 전처리

- (5-1) 행 <=> 열 치환

In [46]:
df2 = df2.T
df2

       0   1           2
0   홍 길동  10  2000/01/23
1   이 나영  21   2020/11/8
2   마 징가  73    1999/5/4
3   베 토벤  89  1987/12/23

- (5-2) 실제 데이터와 타입 확인 후 형변환

In [47]:
df2.head()

       0   1           2
0   홍 길동  10  2000/01/23
1   이 나영  21   2020/11/8
2   마 징가  73    1999/5/4
3   베 토벤  89  1987/12/23

In [48]:
# 1번 컬럼 : object => 정수
df2[1]=df2[1].astype('uint8')

In [49]:
df2.dtypes

0    object
1     uint8
2    object
dtype: object

In [50]:
# 2번 컬럼 : object => datetime64[ns]
df2[2]=df2[2].astype('datetime64[ns]')

In [51]:
df2.dtypes

0            object
1             uint8
2    datetime64[ns]
dtype: object

- (5-3) 0번 컬럼의 이름을 성과 이름으로 분리하기

In [52]:
# 0번 컬럼만 추출 => Series
nameSR = df2[0]
nameSR

0     홍 길동
1     이 나영
2     마 징가
3     베 토벤
Name: 0, dtype: object

In [53]:
# "이 나영" 데이터를 추출 => 성과 이름으로 분리
nameSR[1]

'이 나영'

In [54]:
namesDF = nameSR.str.split(expand=True)
namesDF

   0   1
0  홍  길동
1  이  나영
2  마  징가
3  베  토벤

- (5-4) 두개의 DatafFrame을 컬럼방향으로 연결

In [55]:
pd.concat([df2, namesDF], axis='columns', ignore_index=True)

       0   1          2  3   4
0   홍 길동  10 2000-01-23  홍  길동
1   이 나영  21 2020-11-08  이  나영
2   마 징가  73 1999-05-04  마  징가
3   베 토벤  89 1987-12-23  베  토벤

- (5-5) 2번 컬럼에서 년, 월, 일을 분리

In [56]:
df2[2]

0   2000-01-23
1   2020-11-08
2   1999-05-04
3   1987-12-23
Name: 2, dtype: datetime64[ns]

In [57]:
yearSR = df2[2].dt.year
yearSR

0    2000
1    2020
2    1999
3    1987
Name: 2, dtype: int64

In [58]:
monthSR = df2[2].dt.month
monthSR

0     1
1    11
2     5
3    12
Name: 2, dtype: int64

In [59]:
daySR = df2[2].dt.day
daySR

0    23
1     8
2     4
3    23
Name: 2, dtype: int64

In [62]:
pd.concat([df2, yearSR, monthSR, daySR], axis=1, ignore_index=True)

       0   1          2     3   4   5
0   홍 길동  10 2000-01-23  2000   1  23
1   이 나영  21 2020-11-08  2020  11   8
2   마 징가  73 1999-05-04  1999   5   4
3   베 토벤  89 1987-12-23  1987  12  23

- (5-6) 현재 DataFrame을 파일로 저장하기 => pandas.to_XXX('파일경로+파일명')

In [63]:
# CSV ==> 데이터와 데이터의 구분자
filename = "./backup.csv"       # "backup.csv"

In [64]:
df2.to_csv(filename)